---
kind: other
id: Properties.T:Autodesk.Revit.DB.InternalOrigin
source: html/94d93a9c-04d1-b277-5785-7b661ab2eaba.htm
---
# InternalOrigin Properties

The id of the assembly instance to which the element belongs.